# ViewSchemaSettingForBuilding Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewSchemaSettingForBuilding Property
ParameterTypeId Class See Also
---
"Color Scheme"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewSchemaSettingForBuilding { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewSchemaSettingForBuilding As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewSchemaSettingForBuilding {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace